{
  "Activity": [
    {
      "presenter": "Ou Wenhao",
      "subject": "Ring Signatures and Crypto-Currencies",
      "time": " Apr 24, 2017",
      "place": "F708 New Main Building",
      "intro_en": "Introduced in 2001, a ring signature is a type of digital signature that can be created by anyone in a group of people. In contrast to group signatures, ring signatures are ad-hoc and do not require any coordination among the users. It is originally designed as a way to leak a secret.  Since then, it has found applications as a building in other cryptographic primitives, such as optimistic fair exchange, designated verifier signatures and ad-hoc key exchange In this talk, we are going to review existing results on ring signatures and their variants. Next, we introduce Monero, one of the most popular blockchain-based crypto-currencies. In particular, we discuss how variants of ring signatures are applied in Monero to ensure its security and privacy.  We conclude the talk with some open problems related to the use of ring signatures in blockchain-based crypto-currency and some promising directions.",
      "shortBio": "Dr. Au is currently an assistant professor at the Department of Computing, the Hong Kong Polytechnic University. He has been a lecturer at the School of Computer Science and Software Engineering, University of Wollongong, Australia.Dr. Au’s research interests include Information Security and Privacy, Applied Cryptography, Accountable Anonymity and Cloud Computing. He has published over 100 refereed journal and papers, including the well-respected ACM Conference on Computer and Communications Security (CCS) and the Network and Distributed System Security Symposium (NDSS). His work received many awards, including the 2009 PET runner-up award for outstanding research in privacy enhancing technologies and the best paper award at ACISP 2016. According to Google Scholar, his work has been cited for more than 2000 times, with an h-index of 24 and i-10 index of 54.Dr. Au is an active member in the community and has served as a program committee member of around 30 international conferences. He has served as a PC co-chair of the 12th International Conference on Green, Pervasive and Cloud Computing, the 9th International Conference on Provable Security and the 8th International Conference on Network and System Security. He is an associate editor of the Journal of Information Security and Applications, Elsevier. He has served as a guest editor for various journals including Future Generation Computer Systems, Elsevier and Concurrency and Computation: Practice and Experience, Wiley.\r",
      "poster_url": "View/image/groupMatters/Activities/4/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/4/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/4/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/4/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/4/presenter.jpg"
    },
    {
      "presenter": "Tang Qiang",
      "subject": "Traitor Deterring Schemes: Using Bitcoin As Collateral for Digital Contents",
      "time": "10 AM on Thursday May 9, 2017",
      "place": "F708 New Main Building",
      "intro_en": "We will introduce  a new cryptographic primitive called a Traitor Deterring Scheme (TDS) as a new generation of cryptographic technique for copyright protection. A TDS is a multi-recipient public-key encryption scheme where an authority issues decryption keys to a set of users.The distinguishing feature of a TDS is that secret-keys are issued only  after the users provide some private information as a form of collateral. The traitor deterring property ensures that if a malicious coalition of users (aka ``traitors\u0027\u0027) produces an unauthorized (aka ``pirate\u0027\u0027) decryption device, any recipient of the device will be able to recover at least one of the traitors\u0027 collaterals  with only black-box access to the device. On the other hand, honest users\u0027 collaterals are guaranteed to remain hidden.We show how bitcoin can be used as collateral for real world deployment of TDS‘s for the distribution of digital content. Along the way, we present cryptographic building blocks that may be of independent interest, namely fuzzy lockers, and comparison predicate encryption schemes for exponentially large domains.If time allowed, I may also discuss the connection of TDS to a 20-year open problem of digital signet proposed by Dwork, Lotspiech and Naor at STOC 96.",
      "shortBio": "Qiang Tang is currently an assistant professor at New Jersey Institute of Technology and also a core member of the Cybersecurity Research Center (http://centers.njit.edu/cybersecurity/). His research interests are applied and theoretical cryptography, privacy and computer security. In particular,  accountability, post-Snowden Cryptography, blockchain technology and information theoretic crypto. Before joining NJIT, Qiang was a postdoctoral associate at Cornell University and was also affiliated with IC3: the Initiative of Crypto Currency and Contract (http://www.initc3.org/). Qiang obtained his Ph.D from the University of Connecticut. He was also holding visiting researcher positions at the University of Wisconsin, Madison, NTT research, Tokyo, and the University of Athens, Greece. Qiang\u0027s work has appeared at various top venues including CCS, EUROCRYPT, ASIACRYPT, and IEEE TIFS.\r",
      "poster_url": "View/image/groupMatters/Activities/5/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/5/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/5/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/5/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/5/presenter.jpg"
    },
    {
      "presenter": "Liao Qirui",
      "subject": "(Linkable) Ring Signature and its Applications (Related to Blockchain)",
      "time": "10 AM on Tuesday Jun 6, 2017",
      "place": "F708 New Main Building",
      "intro_en": "Ring signature is a kind of anonymous signature. Verifier only knows that the signer is a user within a group, yet does not know the identity of this signer. In this talk, I will cover the basics of ring signature and linkable ring signature, including The concept, applications, technical constructions and variants. I will further relate linkable ring signature to Monero,  the current third largest blockchain-based cryptocurrency in the world, which is considered to be the most commercial deployment of linkable ring signature nowadays.",
      "shortBio": "Dr. Joseph Liu (廖启瑞博士) 在 2004 年取得香港中文大学信息工程系的博士学位. 他的主要研究范畴包括: 网络安全、个人隐私、身份核实、公钥密码、云安全、大数据隐私保护与安全等。他现在在澳大利亚蒙纳士大学 (Monash University) 信息技术学院 (Faculty of Information Technology) 担任资深讲师。之前，他在新加坡资讯通讯研究院 (Institute for Infocomm Research, I2R) 担任研究员达 7 年之久。他一共发表超过 120 篇论文，当中包括多份 IEEE 期刊 (例如 IEEE TIFS, IEEE Trans. on Computers, IEEE TKDE, IEEE Trans. on Vehicular Technology, IEEE Network 等), 其中两篇论文更获 ESORICS 2014 及 ESORICS 2015 颁发最佳论文奖. 论文被引用超过 3300 次. H 指数高达 32.他的一项有关轻量密码学的研究，在 2013 年被 ISO 採纳成国际标准，供业内同行使用。他同时也担任一些学术会议的主席，包括 ProvSec 2007, 2014, ACISP 2016 以及 ISPEC 2017 等。\r",
      "poster_url": "View/image/groupMatters/Activities/6/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/6/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/6/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/6/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/6/presenter.jpg"
    },
    {
      "presenter": "Liu Zhe",
      "subject": "FourQ on Embedded Devices",
      "time": "10 AM on Thursday Jun 8, 2017",
      "place": "F708 New Main Building",
      "intro_en": "This work deals with the energy-efficient, high-speed and high-security implementation of elliptic curve scalar multiplication and elliptic curve Diffie-Hellman (ECDH) key exchange on embedded devices using FourQ and incorporating strong countermeasures to thwart a wide variety of side-channel attacks. First, we set new speed records for constant-time elliptic curve scalar multiplication and ECDH key exchange with implementations targeting 8, 16 and 32-bit microcontrollers. For example, our software computes a static ECDH shared secret in 7.2 million cycles (or 0.9 seconds @8MHz) on a low-power 8-bit AVR microcontroller which, compared to the fastest Curve25519 and genus 2 Kummer implementations on the same platform, offers 1.9x and 1.4x speedups, respectively. Similarly, it computes the same operation in 559 thousand cycles on a 32-bit ARM Cortex-M4 microcontroller, achieving a factor-2.5 speedup when compared to the fastest Curve25519 implementation targeting the same platform. Second, we engineer a set of side-channel countermeasures taking advantage of FourQ\u0027s rich arithmetic and propose a secure implementation that offers protection against a wide range of sophisticated side-channel attacks, including differential power analysis (DPA).Despite the use of strong countermeasures, the experimental results show that our FourQ software is still efficient enough to outperform implementations of Curve25519 that only protect against timing attacks.Finally, we perform a differential power analysis evaluation of our software running on an ARM Cortex-M4, and report that no leakage was detected with up to 100,000 traces.These results demonstrate the potential of deploying FourQ on low-power applications such as protocols for IoTs. ",
      "shortBio": "刘哲，目前在卢森堡大学安全与信任中心（SnT）从事研究工作（Research Associate）。2015年11月于卢森堡大学(University of Luxembourg)算法、密码与安全实验室获得博士学位，2015年12月到2017年4月在加拿大滑铁卢大学量子研究中心和应用密码研究中心从事博士后研究工作。博士期间，以访问学者身份分别在香港城市大学，比利时（荷兰语）鲁汶大学以及微软总部研究院密码与安全组分别进行访问。刘哲的博士毕业论文“Lightweight Public-Key Cryptography for Wireless Sensor Nodes”获得卢森堡国家基金委2016年评出的唯一杰出博士毕业论文奖(Outstanding Ph.D Thesis Awards)，他也成为了该奖项第一位华人获得者，卢森堡国家基金委，卢森堡大学以及滑铁卢大学量子研究中心进行了专题报道。刘哲已经在国内外密码学术期刊和会议上发表学术论文50多篇，其中20多篇发表在安全类著名期刊和会议上，包括IEEE Transactions on Computers (IEEE TC), IEEE Transactions on Dependable and Secure Computing (IEEE TDSC), IEEE Transactions on Information Forensics and Security (IEEE TIFS); ACM Transactions on Embedded Computing Systems (ACM TECS) 和 IACR Conference on Cryptographic Hardware and Embedded Systems (CHES)，Computers \u0026 Security, Science China (中国科学) 等。刘哲目前担任4个著名安全类期刊的编委，10几个期刊的客座编辑（包括IEEE Transactions on Computers, IEEE Transactions on Emerging Topics in Computing）以及20多个安全类国际会议的程序委员会委员。\r",
      "poster_url": "View/image/groupMatters/Activities/7/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/7/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/7/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/7/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/7/presenter.jpg"
    },
    {
      "presenter": "Su Chunhua",
      "subject": "Cryptographic applications in IoT and Big Data Security and Privacy",
      "time": "11 AM on Thursday Jun 8, 2017",
      "place": "F708 New Main Building",
      "intro_en": "Cryptography is one of the most important core technologies for information security. Nowadays, rapid growth of big data processing and IoT enable services among multiple organizations bring both promising prospects and security\u0026privacy challenges. With light-weight devices which are connected in the environment of IoT networks, huge volume and various data can be gathered from all over the world. It is crucial to secure and utilize such Big data. In this talk, the speaker will introduce his research on design and security analysis of cryptographic primitives, and cryptographic application in construction secure protocols for big data utilization and IoT-enable services, including secure data outsourced analysis,  privacy-preserving data mining and data management, secure authentication schemes for IoT devices and so on.",
      "shortBio": "The speaker Chunhua Su received the B.S. degree for Beijing Electronic and Science Institute in 2003 and received his M.S. and PhD of computer science from Faculty of Engineering, Kyushu University in 2006 and 2009, respectively. He is currently working as an Associate Professor in Division of Computer Science, University of Aizu. He has worked as a research scientist in Cryptography \u0026 Security Department of the Institute for Infocomm Research, Singapore from 2011-2013. From 2013-2016, he has worked as an Assistant professor in School of Information Science, Japan Advanced Institute of Science and Technology. From 2016-2017, he worked as Assistant Professor in Graduate School of Engineering, Osaka University. His research interests include cryptanalysis, cryptographic protocols, privacy-preserving technologies in data mining and IoT security \u0026 privacy.\r",
      "poster_url": "View/image/groupMatters/Activities/8/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/8/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/8/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/8/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/8/presenter.jpg"
    },
    {
      "presenter": "Aniello",
      "subject": "Green Networking and Computing:New Perspectives and Challenges within Energy-oriented Infrastructures and devices.",
      "time": "10:30 AM on Thursday Jun 19, 2017",
      "place": "F829 New Main Building",
      "intro_en": "Energy consumption and the concomitant Green House Gas (GHG) emissions are becoming major issues in modern industrial society. In this scenario, current high performance network infrastructures (routers, switches, line cards, signal regenerators, optical amplifiers, etc.) have reached huge bandwidth capacity but their development has not been compensated at the same rate as for their energy consumption. It is estimated that such infrastructures alone consume 22 GW of electrical power corresponding to more than 1% of the worldwide electrical energy consumption, with a power consumption growth rate of 12% per year, further stressing the need for energy-efficient network devices and energy aware routing protocols and control planes. Analogously, the ever-increasing data volumes to be processed, stored, and accessed every day in modern data centers result in an energy demand growing a faster and faster pace. Data center power and cooling infrastructure worldwide waste more than 60 million MW hours per year of electricity that does no useful work powering IT equipment. This represents an enormous financial burden on industry and is a significant public policy environmental issue. Renewable energy sources are emerging as promising solution both to drastically reduce GHG emissions and to cope with the growing power requirements of these infrastructures, due to their lower energy costs. In particular, the dynamic distribution of computing and storage load in multiple data centers scattered throughout the world can be investigated in order to exploit the availability of renewable energy sources and lower their ecological footprint and contain the energy-related bills. Therefore, new energy-aware paradigms relying on smart grid infrastructure are emerging, able to either divert the network traffic on energy-efficient equipment or, analogously, to direct computing tasks or the data towards a site which is currently green powered (thus, in a follow-the-renewable energy manner), or to request to the smart grid a quantity and quality of energy (e.g., from an available renewable energy production site) for the facility (in a follow-the-data manner). Such energy-aware paradigms unveil new potentials for the ICT that have not been explored before. The main objective of this lecture is presenting the current challenges and research trends for eco-sustainable ICT infrastructures and the new energy-aware networking and computing models, protocols, architectures, techniques and paradigms that, considering power usage as a new constraint, optimize the use of energy and reduce the GHG emissions for achieving a more sustainable society that will be a basis for growth and prosperity. Also, some emerging energetic attacks to datacenters and mobile equipments are presented.",
      "shortBio": "Aniello Castiglione (S’04–M’08) received the Ph.D. degree in Computer Science from the University of Salerno (Italy). Actually he is an adjunct professor at the University of Salerno (Italy) and at the University of Naples “Federico II” (Italy). He received the Italian national qualification as Associate Professor in Computer Science. He published more than 150 papers in international journals and conferences. He served as Program Chair and TPC Member in around 130 international conferences. One of his papers has been selected as “Featured Article” in the IEEE Cybersecurity initiative. He served as a Reviewer for several international journals and he is the Managing Editor of two ISI-ranked international journals. He acted as a Guest Editor in several journals and serves as Editor in several editorial boards of international journals. His current research interests include Information Forensics, Digital Forensics, Security and Privacy on Cloud, Communication Networks, and Applied Cryptography. He is a member of several associations, including IEEE and ACM. He has been involved in forensic investigations, collaborating as a consultant with several law enforcement agencies. From its establishment, he is a member of the European Electronic Crime Task Force (ECTF).\r",
      "poster_url": "View/image/groupMatters/Activities/9/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/9/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/9/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/9/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/9/presenter.jpg"
    },
    {
      "presenter": "Zhu Haojin",
      "subject": "When CSI Meets Public WiFi: Inferring Your Mobile Phone Password via WiFi Signals",
      "time": "10 AM on Friday Jul 21, 2017",
      "place": "F708 New Main Building",
      "intro_en": "In this study, we present WindTalker, a novel and practical keystroke inference framework that allows an attacker to infer the sensitive keystrokes on a mobile device through WiFi-based side-channel information. WindTalker is motivated from the observation that keystrokes on mobile devices will lead to different hand coverage and the finger motions, which will introduce a unique interference to the multi-path signals and can be reflected by the channel state information (CSI). The adversary can exploit the strong correlation between the CSI fluctuation and the keystrokes to infer the user’s number input. WindTalker presents a novel approach to collect the target’s CSI data by deploying a public WiFi hotspot. Compared with the previous keystroke inference approach, WindTalker neither deploys external devices close to the target device nor compromises the target device. Instead, it utilizes the public WiFi to collect user’s CSI data, which is easy-to-deploy and difficult-to-detect. In addition, it jointly analyzes the traffic and the CSI to launch the keystroke inference only for the sensitive period where password entering occurs. WindTalker can be launched without the requirement of visually seeing the smart phone user’s input process, backside motion, or installing any malware on the tablet. We implemented Windtalker on several mobile phones and performed a detailed case study to evaluate the practicality of the password inference towards Alipay, the largest mobile payment platform in the world. The evaluation results show that the attacker can recover the key with a high successful rate.",
      "shortBio": "\"朱浩瑾，男，加拿大滑铁卢大学博士，上海交通大学计算机科学与工程系教授。主要研究领域为移动网络安全与隐私保护。已发表SCI期刊38篇，其中包括：IEEE JSAC, IEEE TDSC, IEEE TPDS, IEEE TMC, IEEE TWC等IEEE 期刊27篇；已发表（或录用）国际会议65篇，其中包括：顶级会议ACM CCS, ACM MOBICOM, ACM MOBIHOC, IEEE INFOCOM, IEEE ICDCS, ACM ASIACCS等。Google Scholar总引用次数3842余次，H-index 32，SCI他引420次。3篇论文入选ESI高引用论文(Highly Cited Papers)及热点论文，2篇论文被推荐为IEEE最佳阅读论文。相关研究成果受到Communications of ACM, The Register, The TechNews, Techworm, SPIEGEL ONLINE, Silicon, Fossbytes, Bitport等多个国际媒体的广泛报道。",
      "poster_url": "View/image/groupMatters/Activities/10/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/10/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/10/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/10/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/10/presenter.jpg"
    },
    {
      "presenter": "Zhou Hongsheng",
      "subject": "Statement Voting",
      "time": "3 PM on Sunday Aug 8, 2017",
      "place": "F706 New Main Building",
      "intro_en": "Elections provide people with the opportunity to express their opinions in the collective decision making process. However, the existing (election) voting systems have many limitations and often fail to serve the best interest of the people. In this talk, I will introduce a new concept called ``statement voting\u0027\u0027: instead of defining a fixed election candidate and determining the vote in the voting phase (as in conventional voting schemes), each voter can define a statement in his or her ballot in the voting phase, and then the statement will determine the vote in the tally phase. Statement voting allows us to develop alternative decision making models to make better use of ``the wisdom of crowds\u0027\u0027. As an immediate application, based on statement voting, we design the first efficient liquid democracy e-voting scheme.This is joint work with Bingsheng Zhang.",
      "shortBio": "Hong-Sheng Zhou is an Assistant Professor in the Computer Science Department at Virginia Commonwealth University. He was a postdoc at Maryland Cybersecurity Center, as a recipient of NSF Computing Innovation Fellowship, under the direction of Jonathan Katz. Before that, he  received his PhD at the University of Connecticut with Aggelos Kiayias as advisor.Hong-Sheng is currently working on multiple directions in cryptography including Cryptocurrency and Blockchain Technologies, Post-Snowden Cryptography, Secure Multi-Party Computation, Functional Encryption and Obfuscation, Fully Homomorphic Encryption, and Verifiable Computation. He has published papers in the world\u0027s leading cryptography/security conferences, such as CRYPTO, EUROCRYPT, CCS, TCC, ITCS, PODC, ASIACRYPT, CSF. More information about his research can be found at his group page http://cryptographylab.bitbucket.io/\r",
      "poster_url": "View/image/groupMatters/Activities/11/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/11/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/11/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/11/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/11/presenter.jpg"
    },
    {
      "presenter": "Yang Guomin",
      "subject": "New Development of Public Key Encryption with Keyword Search Secure under Insider Keyword Guessing Attack",
      "time": "3 PM on Monday Aug 28, 2017",
      "place": "F804 New Main Building",
      "intro_en": "Public key encryption with keyword search (PEKS) is a well-known cryptographic primitive for enabling secure searching over encrypted data.However, the traditional PEKS schemes are vulnerable to the insider offline keyword guessing attack where an honest-but-curious server handling the searching queries can easily identify the keyword corresponding to an encrypted file or a search query. In this talk, several new PEKS design paradigms for preventing the insider keyword guessing attack will be presented.",
      "shortBio": "Dr. Guomin Yang is a Senior Lecturer and DECRA Research Fellow at the School of Computing and Information Technology, University of Wollongong (UOW), Australia. He was admitted to the Mathematics Department of Fudan University in 1999, and moved to City University of Hong Kong in 2000 after being awarded the Hong Kong Jockey Club Scholarship. He received the Bachelor, Master and PhD degrees in Computer Science from City University of Hong Kong in 2004, 2006 and 2009, respectively. Before joining UOW in 2012, he was a Research Scientist at the Temasek Laboratories, National University of Singapore. Dr. Yang’s research interests are applied cryptography and network security. He has published over 90 research papers that have appeared at many respected venues such as ACM/IEEE Transactions, CRYPTO, ASIACRYPT, PKC, CT-RSA, etc. In 2015, he received the Australian Research Council Discovery Early Career Researcher Award.",
      "poster_url": "View/image/groupMatters/Activities/12/post.jpg",
      "pc1_url": "View/image/groupMatters/Activities/12/现场1.jpg",
      "pc2_url": "View/image/groupMatters/Activities/12/现场2.jpg",
      "pc3_url": "View/image/groupMatters/Activities/12/现场3.jpg",
      "speaker_url": "View/image/groupMatters/Activities/12/presenter.jpg"
    }
  ],
  "Cooperation": [
    {
      "intro": "Received his BS degree in information security and MS degree in Cryptography from Southwest Jiaotong University, China, in 2007 and 2010, respectively. Currently, he is a Ph. D candidate of information security at Wuhan University, China. His research interests include cryptography, security proof and data privacy in cloud computing.",
      "name": "Hua Deng",
      "pic_url": "View/image/groupMatters/Cooperation/HuaDeng.jpg"
    },
    {
      "intro": "Has been a Professor at the School of Information Systems, Singapore Management University since 2004. Prior to this, he was Principal Scientist and Manager of Infocomm Security Department, Institute for Infocomm Research, Singapore. His research interests include data security and privacy, multimedia security, network and system security.  He has served on the editorial boards of many international journals including IEEE Transactions on Information Forensics and Security, IEEE Transactions on Dependable and Secure Computing, Journal of Computer Science and Technology (the Chinese Academy of Sciences) and International Journal of Information Security. He is currently the chair of the steering committee of the ACM Asia Conference on Computer and Communications Security (AsiaCCS). He received the University Outstanding Researcher Award from the National University of Singapore in 1999 and the Lee Kuan Yew Fellow for Research Excellence from the Singapore Management University in 2006. He was named Community Service Star and Showcased Senior Information Security Professional by (ISC)^2 under its Asia-Pacific Information Security Leadership Achievements program in 2010.",
      "name": "Robert H. Deng",
      "pic_url": "View/image/groupMatters/Cooperation/Robert Deng.jpg"
    },
    {
      "intro": "Received the Ph.D. degree in control engineering from the Harbin Institute of Technology, China, in 1993, and the master\u0027s degree in computer science and software engineering from Monash University, Australia, in 2000. He was a Research Fellow with the Delft University of Technology, The Netherlands, from 1997 to 1998, and Melbourne University, Australia, from 1998 to 1999. He has been with Ruhr University, Bochum, Germany. He is currently a full Professor and Research Director of the Cyber Security Laboratory with the School of Engineering and Information Technology, University of New South Wales, Australia. He received the prestigious German Alexander von Humboldt Fellowship from Ruhr University from 1995 to 1996. His main research interest is in the field of cyber security, including biometrics security, where he has published many papers in high-quality conferences and journals, including the IEEE Transactions on pattern analysis and machine intelligence. He has received seven Australian Research Council (ARC) Grants, and serves at the prestigious Panel of Mathematics, Information and Computing Sciences and the ARC Excellence in Research for Australia Evaluation Committee. He has served on the Editorial Board of up to seven international journals including IEEE Transactions on Information Forensics and Security, and served as the Security Symposium Chair of the IEEE ICC and the IEEE Globecom.",
      "name": "Jiankun Hu",
      "pic_url": "View/image/groupMatters/Cooperation/JiankunHu.jpg"
    },
    {
      "intro": "Received his B.S. and M.S. on Mathematics from Northwest University, China in 1998 and 2000, respectively. He got his Ph.D degree in Cryptography from Xidian University in 2003. Currently, he works at Xidian University as a professor. His research interests include applied cryptography and cloud computing security. He has published over 100 research papers in refereed international conferences and journals. His work has been cited more than 3000 timesat Google Scholar. He is in the Editorial Board of Security and Communication Networks (SCN), Computing and Informatics (CAI), and International Journal of Embedded Systems (IJES) etc. He has served as the program/general chair or program committee member in over 30 international conferences.",
      "name": "Xiaofeng Chen",
      "pic_url": "View/image/groupMatters/Cooperation/XiaofengChen.jpg"
    },
    {
      "intro": "Received his Ph.D. in communication engineering from Xidian University, China in 1998, and his B.S. and M.S. degrees in electronic engineering from Shandong University, China in 1985 and 1988. He is currently a professor and head of School of Electronic and Information Engineering of Beihang University. His research interests are the security of wireless and mobile communication network and computer network. He is a senior member of the Chinese Institute of Electronics and director of the Chinese Association for Cryptologic Research.",
      "name": "Jianwei Liu",
      "pic_url": "View/image/groupMatters/Cooperation/jianweiliu.jpg"
    },
    {
      "intro": "Received B.S., M.S., and Ph.D. degrees in Electronic Engineering from Beihang University, Beijing, China in 1987, 1990, and 2001, respectively. He is currently a professor and vice president at the BUAA. He also serves as the Director of Communication, Navigation, Surveillance/Air Traffic Management (CNS/ATM) Labs, Civil Aviation Administration of China (CAAC). His key research areas include CNS/ATM, mobile networks and air/space/ground communication networks.",
      "name": "Jun Zhang",
      "pic_url": "View/image/groupMatters/Cooperation/JunZhang.jpg"
    },
    {
      "intro": "Received his Ph.D in Computer Software and Theory from Tongji University. He is currently an associate professor in the School of Information Engineering at Hu zhou University, he is also a Postdoctoral in the institute of Cyber Systems and Control, Zhejiang University. His research interests including software reliability evaluation, system performance evaluation, neural network optimization, dependable computing and time series prediction.",
      "name": "Jungang Lou",
      "pic_url": "View/image/groupMatters/Cooperation/JungangLou.JPG"
    },
    {
      "intro": "Received the Ph.D. degree from the School of Computer Science and Software Engineering, University of Wollongong, Australia. He is currently a Professor with the School of Mathematics and Computer Science, Fujian Normal University, China, and the Co-Director of Fujian Provincial Key Laboratory of Network Security and Cryptology. His research interests include applied cryptography and network security. He has authored over 100 research papers in refereed international conferences and journals. His work has been cited more than 2900 times at Google Scholar (H-Index: 27). He is an associate editor of IEEE Transactions on Dependable and Secure Computing.",
      "name": "Xinyi Huang",
      "pic_url": "View/image/groupMatters/Cooperation/Xinyi_huang.jpg"
    },
    {
      "intro": "As a Professor with the School of Computer Science and IT, RMIT University, Australia. His research interests include applied cryptography, computer and network security, mobile and wireless communication security, and privacy-preserving data mining.  He has published more than 150 research papers in international journals, such as IEEE Trans. Knowledge and Data Engineering, IEEE Trans. Wireless Communication, IEEE Trans. Dependable and Secure Computing, IEEE Trans. Circuit and Systems, IEEE Trans. Vehicular Technologies, IEEE Communication Letters, IEE Electronic Letters, and conference proceedings. He has ever undertaken program committee members for more than 20 international conferences. Recently, he has led a few of Australia Research Council (ARC) Discovery Projects.",
      "name": "Xun Yi",
      "pic_url": "View/image/groupMatters/Cooperation/XunYi.jpg"
    },
    {
      "intro": "As a professor in School of Mathematics, Shandong University P.R.China. She received her B.S. from Information Engineering University, Zhenzhou, P.R.China in 1982 and Ph.D. degree from School of Mathematics in Shandong University, P.R.China in 2004. Her research interests include computational number theory, information security, design and analysis of security about cryptologic protocols. She has co-authored 2 books and has published about 30 professional research papers. Prof. Qin is a senior member of Chinese Association for Cryptologic Research (CACR) as well as China Computer Federation (CCF).",
      "name": "Jing Qin",
      "pic_url": "View/image/groupMatters/Cooperation/JingQin.jpg"
    },
    {
      "intro": "Received the M.S. and the Ph.D. degrees in cryptology from Xidian University, Xi’an, China, in 2003 and 2005, respectively. He is currently a Professor at the School of Mathematics and Computational Science, Guilin University of Electronic Technology, Guilin, China. He is now a senior member of Chinese Association for Cryptologic Research (CACR). His current research interests include cryptography and network security.",
      "name": "Ding Yong",
      "pic_url": "View/image/groupMatters/Cooperation/YongDing.jpg"
    },
    {
      "intro": "Received his Bachelor from Peking University, Master and Ph.D. from Chinese Academy of Science. He is not now a professor of Renmin University of China and an adjunct professor of Institute of Information Engineering, Chinese Academy of Sciences. His research interests include information system security and operation system security. He has published over 100 publications in these areas.",
      "name": "Wenchang Shi",
      "pic_url": "View/image/groupMatters/Cooperation/WenchangShi.jpg"
    },
    {
      "intro": "As a Professor with the Computer Science and Technology Department, Tongji University, Shanghai, China. He received his B.S. degree in Information Engineering and M.S. degree in Communication and Electronic System from Xdian University in 1993 and 1996, respectively.He received his Ph.D. degrees in Signal and Information Procesing from Beijing University of Posts and Telecommunications in 1999. Wu joined in Tongji University as an professor in 2010. He had been a Principal Scientist in Huawei and Broadcom before he joined Tongji. His research interests include Wireless Communication, Information Theory, and Signal Processing.",
      "name": "Jun Wu",
      "pic_url": "View/image/groupMatters/Cooperation/wujun.jpg"
    },
    {
      "intro": "Received his doctor degree from Institute of Software Chinese Academy of Sciences. He had been with Tsinghua University as postdoctoral fellow and now with Renmin University of China as a professor. His research interests include security Analysis of software system, information security countermeasures and system software security mechanism. He has published tens of publications in these areas.",
      "name": "Liang Bin",
      "pic_url": "View/image/groupMatters/Cooperation/liangbin.jpg"
    },
    {
      "intro": "Received the Ph.D. degrees from the City University of Hong Kong, Hong Kong, and Wuhan University, Wuhan, China, under the joint Ph.D program, in 2014. He is currently a Research Fellow with the School of Information System, Singapore Management University. His research interests include cryptography and information security, in particular, cryptographic protocols, signature schemes and security in cloud computing.",
      "name": "Yujue Wang",
      "pic_url": "View/image/groupMatters/Cooperation/yjwang.jpg"
    }
  ]
}
